{
	"Metadata": {
		"Home": {
			"title": "Portfolio Miguel Alexandre Uhlein",
			"description": "Me conheça melhor e visualize meus projetos!"
		}
	},
	"Header": {
		"about": "Sobre",
		"skills": "Competências",
		"projects": "Projetos",
		"contact": "Contato"
	},
	"Theme": {
		"Dark": "Escuro",
		"Light": "Claro"
	},
	"WIP": "🚧 Este projeto está sob desenvolvimento 🚧",
	"Start": {
		"Hello": "Olá, Mundo!",
		"Name": "Meu nome é Miguel",
		"Details": "Seu próximo Desenvolvedor Back-end"
	},
	"About": {
		"Title": "Sobre",
		"Text": "Olá! Meu nome é Miguel, tenho 20 anos e sou programador backend.<br></br> Tenho experiência no desenvolvimento de aplicações utilizando NestJS, TypeScript, JavaScript e NodeJS.<br></br><br></br>Minha paixão por tecnologia e programação começou cedo, pois meu pai tinha uma loja de informática. Essa exposição me levou à área de programação, e desde então venho me especializando em criar soluções eficientes e escaláveis. Gosto de enfrentar desafios e estou sempre buscando aprender e aprimorar minhas habilidades.<br></br><br></br>Trabalho com foco em entregar código de alta qualidade, seguindo boas práticas e mantendo uma comunicação clara com a equipe. Acredito que a colaboração e o aprendizado contínuo são essenciais para o sucesso em projetos de desenvolvimento de software.<br></br><br></br>Tenho interesse em expandir minhas habilidades e trabalhar com C# e Rust, explorando novas linguagens e tecnologias.<br></br><br></br>Se você está interessado em saber mais sobre meu trabalho ou colaborar em algum projeto, sinta-se à vontade para <contact>entrar em contato!</contact>",
		"Button": "Expandir...",
		"Button2": "Recolher..."
	},
  "Skills": {
    "Title": "Competências",
    "NodeJS": {
      "Title": "NodeJS",
      "Description": "Node.js é um tempo de execução JavaScript construído no motor JavaScript V8 do Chrome. É um tempo de execução JavaScript assíncrono orientado a eventos projetado para criar aplicativos de rede escaláveis."
    },
    "TypeScript": {
      "Title": "TypeScript",
      "Description": "TypeScript é um superset do JavaScript que adiciona tipagem estática opcional à linguagem. É projetado para o desenvolvimento de grandes"
    },
    "JavaScript": {
      "Title": "JavaScript",
      "Description": "JavaScript é uma linguagem de programação interpretada de alto nível que está em conformidade com a especificação ECMAScript. É uma linguagem que também é caracterizada como dinâmica, de tipagem fraca, baseada em protótipos e multiparadigma."
    },
    "NestJS": {
      "Title": "NestJS",
      "Description": "NestJS é um framework para construir aplicativos eficientes e escaláveis do lado do servidor Node.js. Ele usa JavaScript progressivo, é construído com TypeScript e combina elementos de OOP (Programação Orientada a Objetos), FP (Programação Funcional) e FRP (Programação Funcional Reativa)."
    }
  },
	"Error": {
		"Copy": "Copiar",
		"Reload": "Clique aqui para voltar para a página principal",
		"Toast": {
			"Title": "Erro copiado!",
			"Description": "Código de erro copiado para a area de transferência"
		}
	},
	"Languages": {
		"pt-BR": "Português",
		"en-US": "Inglês"
	}
}
